In [45]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [46]:
np.random.seed(1)

In [47]:
data = np.random.randint(30,101, size=(4,6) )
data

array([[67, 42, 39, 35, 94, 46],
       [31, 36, 55, 80, 50, 48],
       [41, 58, 59, 44, 80, 98],
       [43, 39, 37, 93, 91, 52]])

In [50]:
df = pd.DataFrame( data )
df

    0   1   2   3   4   5
0  67  42  39  35  94  46
1  31  36  55  80  50  48
2  41  58  59  44  80  98
3  43  39  37  93  91  52

In [21]:
df['년도'] = [2018,2018,2019,2019]
df['반'] = ['1반','2반','1반','2반']
df

    0   1   2    3   4   5    년도   반
0  87  31  30   90  38  43  2018  1반
1  77  60  33  100  51  79  2018  2반
2  87  33  98   54  73  56  2019  1반
3  82  71  45   94  98  55  2019  2반

In [22]:
df.set_index(['년도','반'])

          0   1   2    3   4   5
년도   반
2018 1반  87  31  30   90  38  43
     2반  77  60  33  100  51  79
2019 1반  87  33  98   54  73  56
     2반  82  71  45   94  98  55

In [51]:
df.index = pd.MultiIndex.from_product( [[2018,2019],['1반','2반'] ], names=['년도','반']  )
df

          0   1   2   3   4   5
년도   반
2018 1반  67  42  39  35  94  46
     2반  31  36  55  80  50  48
2019 1반  41  58  59  44  80  98
     2반  43  39  37  93  91  52

In [24]:
df.index

MultiIndex([(2018, '1반'),
            (2018, '2반'),
            (2019, '1반'),
            (2019, '2반')],
           names=['년도', '반'])

In [25]:
df.index.levels[0]

Int64Index([2018, 2019], dtype='int64', name='년도')

In [26]:
df.index.levels[1]

Index(['1반', '2반'], dtype='object', name='반')

In [27]:
df.index.get_level_values(0)

Int64Index([2018, 2018, 2019, 2019], dtype='int64', name='년도')

In [30]:
df.index.get_level_values(1)

Index(['1반', '2반', '1반', '2반'], dtype='object', name='반')

In [36]:
df.columns = pd.MultiIndex.from_product([['홍길동','이순신','임꺽정'], ['국어','영어'] ] )

In [39]:
df

        홍길동     이순신     임꺽정
         국어  영어  국어  영어  국어  영어
년도   반
2018 1반  67  42  39  35  94  46
     2반  31  36  55  80  50  48
2019 1반  41  58  59  44  80  98
     2반  43  39  37  93  91  52

In [43]:
df.loc[2018]

   홍길동     이순신     임꺽정
    국어  영어  국어  영어  국어  영어
반
1반  67  42  39  35  94  46
2반  31  36  55  80  50  48

In [44]:
df['홍길동']['국어']

년도    반
2018  1반    67
      2반    31
2019  1반    41
      2반    43
Name: 국어, dtype: int32